const holidays = [
  "正月",            //0//
  "成人の日",        //1//
  "建国記念日",      //2//
  "天皇誕生日",      //3//
  "春分の日",        //4//
  "昭和の日",        //5//
  "憲法記念日",      //6//
  "みどりの日",      //7//
  "こどもの日",      //8//
  "海の日",          //9//
  "山の日",          //10//
  "敬老の日",        //11//
  "秋分の日",        //12//
  "スポーツの日",    //13//
  "文化の日",        //14//
  "勤労感謝の日"     //15//
];

let i = -1;

while ( i<15 ) {
  i++
  console.log(holidays[i]);
}

for (let i=0; i<16; i++ ) {
  console.log(holidays[i]);
}